<a href="https://colab.research.google.com/github/NilmaraSalgado/EducacaoBemolDigital/blob/main/desafioBemolNil_v01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**1.** Uma informação importante para varejistas, como a Bemol, é o Lead Time (LT) de entrega das mercadorias compradas. Ou seja, o período de espera até o recebimento de um produto, contando a partir da confirmação de compra com o fornecedor. Sabendo disso, queremos que você nos ajude a identificar o **LT médio de entrega** que alguns dos nossos fornecedores possuem, a partir de um breve histórico.

Para resolver esse problema, nós extraímos dois arquivos para você trabalhar:
**entregas_tab.txt** e **prods_tab.csv**. O primeiro, apresenta os dados em um formato específico do nosso sistema, separados por pipes (|). Já o segundo arquivo contém dados separados por vírgulas (.CSV), porém com algumas deficiências de formatação. Ambos os arquivos necessitam de um bom préprocessamento visando manter apenas informações relevantes, uma vez que há alguns ruídos como linhas repetidas ou em branco, caracteres indesejados, dados ausentes e espaços indesejados.

Com esses arquivos, você deverá identificar o **tempo médio (em dias)** que dado fornecedor leva para entregar seus produtos ao nosso Centro de Distribuição.
* O arquivo entregas_tab.txt apresenta um histórico contendo datas de compra e entrega de alguns produtos.
* O arquivo prods_tab.csv contém o código dos fornecedores, além de dados como a descrição e o identificador dos produtos que ele vende. 

Você deverá usar esses dois arquivos para **gerar uma saída** com apenas duas colunas:  **fornecedor e lt**. 

**2.** Faça um merge utilizando os dois arquivos:
clientes.txt
bonus.txt
 A chave principal que relaciona um arquivo com o outro é o cliente. Vale lembrar que o arquivo
**clientes.txt** está sem cabeçalho, também é seu desafio criá-los.
A primeira coluna é o cliente, o restante das colunas fica a seu critério colocar o nome que quiser.
Ao final, **classificar os clientes por pedras** (AZUL, PRATA, OURO, DIAMANTE e DIAMANTE+)
Regras:
pontos totais = saldo + historico
AZUL: até 6000
PRATA: até 10000
OURO: até 20000
DIAMANTE: até 50000
DIAMANTE+: acima de 50000
Sua saída deve ser um arquivo chamado "DADOS.txt".

In [ ]:
import pandas as pd

## **1 Leitura de Arquivos**

In [ ]:
#guardando na variável df_endereco (txt ou csv)
df_bonus = pd.read_csv('bonus.txt',sep ='|', delimiter=";", skiprows = 0, encoding='latin-1', dtype={1:'str'})

In [ ]:
df_cliente = pd.read_csv('clientes.txt', sep = '|', skiprows = 0, encoding='latin-1',dtype={1:'str'})

In [ ]:
df_entrega = pd.read_csv('entregas_tab.txt', sep='|', skiprows = 5, encoding='latin-1', dtype={1:'str'})

In [ ]:
df_prods_tab = pd.read_csv('prods_tab.csv', sep=',', skiprows = 0, encoding='latin-1', dtype={1:'str'})

In [ ]:
df_dados = pd.read_excel('dados.xlsx', skiprows=1, dtype={0:'str'}, sheet_name=0)

## **2 Visualizar DataFrames**

In [ ]:
df_bonus.head()

In [ ]:
df_cliente.head()

In [ ]:
df_entrega.head()

In [ ]:
df_prods_tab.head()

   ID. Forn.  ... COD. MARC.
0        NaN  ...        NaN
1  302100012  ...        302
2  302100012  ...        NaN
3  302100012  ...        302
4        NaN  ...        NaN

[5 rows x 5 columns]

In [ ]:
df_dados.head()

In [ ]:
#alocar colunas para visualizção
df_bonus.iloc[1:8,0:11]

## **3 Tratamento de Dados**

In [ ]:
# visualizar colunas. Observar os espaços em branco.
df_entrega.columns

Index(['Unnamed: 0', 'SKU.   ', 'DT.Compra', 'Dt.Chegada', 'SKTD',
       'Unnamed: 5'],
      dtype='object')

In [ ]:
#renomear
df_entrega = df_entrega.rename(columns={'Unnamed: 0':'semNome','codigo':'codigoEntrega','DT.Compra':'dataCompra','Dt.Chegada':'dataChegada','SKTD':'codigo 2', 'Unnamed: 5':'semNome2'})
df_entrega

                       codigoEntrega   dataCompra   dataChegada  codigo 2
0  ---------------------------------          NaN           NaN       NaN
1                            100312   2017-12-02   2018-01-05        27.0
2                            89721    2017-12-02   2018-01-05        26.0
3                            192063   2017-12-05   2018-01-04        25.0
4                            182285   2017-12-05   2018-01-07        24.0
5                            32934    2017-12-10   2018-01-05        21.0
6                            43495    2017-12-02   2018-01-12        22.0
7                            4342     2017-12-02   2018-01-10        23.0
8                            3124     2017-12-04   2018-01-04        28.0
9                            43495    2017-12-07   2018-01-05        23.0

In [ ]:
#deletando colunas
df_entrega = df_entrega.drop(['semNome', 'semNome2'], axis = 1)

In [ ]:
df_entrega

In [ ]:
#deletando linhas
df_entrega.drop([0], axis = 0)

In [ ]:
# visualizar colunas. Observar os espaços em branco.
df_prods_tab.columns

Index(['ID. Forn.', 'Prod. DESC.', 'SKU.', 'GRP. MERC. 3', 'COD. MARC.'], dtype='object')

In [ ]:
#renomear
df_prods_tab = df_prods_tab.rename(columns={'ID. Forn.':'fornecedor','Prod. DESC.':'descricao','codigo':'codigoProduto','GRP. MERC. 3':'grupoMercadoria','COD. MARC.':'marca' })
df_prods_tab

    fornecedor  ...       marca
0          NaN  ...         NaN
1    302100012  ...         302
2    302100012  ...         NaN
3    302100012  ...         302
4          NaN  ...         NaN
5    ID. Forn.  ...  COD. MARC.
6    302100012  ...         302
7          NaN  ...         NaN
8    ID. Forn.  ...  COD. MARC.
9          NaN  ...         NaN
10  9009101002  ...         401
11  9030121093  ...         607
12   320621093  ...         481
13   320621093  ...         481
14  9030121093  ...         607
15         NaN  ...         NaN

[16 rows x 5 columns]

In [ ]:
#deletando linhas
df_prods_tab.drop([0,4,5,7,8,9,15], axis = 0)

    fornecedor  ... marca
1    302100012  ...   302
2    302100012  ...   NaN
3    302100012  ...   302
6    302100012  ...   302
10  9009101002  ...   401
11  9030121093  ...   607
12   320621093  ...   481
13   320621093  ...   481
14  9030121093  ...   607

[9 rows x 5 columns]